/*
 * ////////////////////////////////////////////////////////////////////////////////
 * 本程序只供学习使用，未经作者许可，不得用于其它任何用途
 *  文 件 名   : oled.c
 *  版 本 号   : v2.0
 *  作    者   :
 *  生成日期   : 2014-0101
 *  最近修改   :
 *  功能描述   : OLED 接口演示例程(MSP430F149系列)
 *              说明:
 *              ----------------------------------------------------------------
 *              GND    电源地
 *              VCC   接5V或3.3v电源
 *              SCL   接P2.7（时钟）
 *              SDA   接P3.3（数据）
 *              RES   接P1.3
 *              DC    接P1.2
 *              CS    接P1.4  ----本模块已经帮用户接地，无需再接
 *              ----------------------------------------------------------------
 * ****************************************************************************** /
 */
#include	<msp430.h>

#include "oled.h"
#include "bmp.h"
#include "DS18B20.c"
int main( void )
{
	WDTCTL = WDTPW + WDTHOLD;
	Clock_Init();        //系统时钟设置
	delay_ms(100);
	OLED_Init();		 //初始化OLED
	OLED_Clear();

	DS18B20_Reset();	 //复位D18B20
	while(1)
	{
            unsigned char j;
	    ds1820_start();		          //启动一次转换
	    ds1820_read_temp();		          //读取温度数值
	    data_do(temp_value);                  //处理数据，得到要显示的值
	    for(j=0;j<30;j++)
	    {
	    	OLED_ShowString(30,10,Temp_Value);		//显示温度，温度值在Temp_Value数组里
	    }
	}

}
